name: "ensemble_ocr_lp"
platform: "ensemble"
max_batch_size: 1
input [
{
  name: "INPUT"
  data_type: TYPE_UINT8
  dims: [ -1, -1, 3 ]
}
]
output [
  {
    name: "OUTPUT"
    data_type: TYPE_FP32
    dims: [ 36 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: -1
      input_map {
        key: "inp_image"
        value: "INPUT"
      }
      output_map {
        key: "preprocess_image"
        value: "preprocess_image"
      }
    },
    {
      model_name: "yolov7lp_det_tensorrt"
      model_version: -1
      input_map {
        key: "images"
        value: "preprocess_image"
      }
      output_map {
        key: "num_dets"
        value: "num_dets_inp"
      }
      output_map {
        key: "det_boxes"
        value: "det_boxes_inp"
      }
      output_map {
        key: "det_scores"
        value: "det_scores_inp"
      }
      output_map {
        key: "det_classes"
        value: "det_classes_inp"
      }
    },
    {
      model_name: "text_region_extractor"
      model_version: -1
      input_map {
        key: "INPUT_0"
        value: "INPUT"
      }
      input_map {
        key: "INPUT_1"
        value: "num_dets_inp"
      }
      input_map {
        key: "INPUT_2"
        value: "det_boxes_inp"
      }
      input_map {
        key: "INPUT_3"
        value: "det_scores_inp"
      }
      input_map {
        key: "INPUT_4"
        value: "det_classes_inp"
      }
      output_map {
        key: "regions_output"
        value: "regions_output"
      }
    },
    {
      model_name: "text_reg"
      model_version: -1
      input_map {
        key: "images"  
        value: "regions_output"
      }
      output_map {
        key: "output"
        value: "OUTPUT"
      }
    }
  ]
}
