name: "lp_ocr_ensemble"
platform: "ensemble"
max_batch_size: 128
input [
{
  name: "INPUT"
  data_type: TYPE_FP32
  dims: [ 3, 640, 640 ]
}
]

output [
  {
    name: "OUTPUT"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "yolov7lp_det_tensorrt"
      model_version: -1
      input_map {
        key: "images"
        value: "INPUT"
      }
      output_map {
        key: "num_dets"
        value: "num_dets_inp"
      }
      output_map {
        key: "det_boxes"
        value: "det_boxes_inp"
      }
      output_map {
        key: "det_scores"
        value: "det_scores_inp"
      }
      output_map {
        key: "det_classes"
        value: "det_classes_inp"
      }
    },
    {
      model_name: "text_region_model"
      model_version: -1
      input_map {
        key: "INPUT_0"
        value: "INPUT"
      }
      input_map {
        key: "INPUT_1"
        value: "num_dets_inp"
      }
      input_map {
        key: "INPUT_2"
        value: "det_boxes_inp"
      }
      input_map {
        key: "INPUT_3"
        value: "det_scores_inp"
      }
      input_map {
        key: "INPUT_4"
        value: "det_classes_inp"
      }
      output_map {
        key: "OUPUT_0"
        value: "OUTPUT"
      }
    }
  ]
}